{"class_name": "Model", "config": {"name": "Autoencoder", "layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "Encoding", "class_name": "Dense", "config": {"name": "Encoding", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "Reconstruction", "class_name": "Dense", "config": {"name": "Reconstruction", "trainable": true, "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Encoding", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["Reconstruction", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}